[
    {
        "name": "Magehunter Armor",
        "entries": [
            "(Variante di un armatura normale qualunque, oggetto è di un tipo specifico)",
            "This magical armor has 3 charges. When you are subjected to a magical effect that allows you to make a saving throw to take only half damage, you can expend a charge to instead take no damage on a success and only half as much damage on a failure. The armor regains all expended charges at dusk.",
            "Additionally, while you are attuned to this armor and wearing it, acid, cold, fire, lightning, and thunder damage you take from magical sources, as well as magical healing you receive, is reduced by 3. When you take damage from a magical melee weapon, the attacker must roll a {@dice d20}. On a 10 or lower, the weapon's magic is suppressed for 1 hour, causing it to temporarily become mundane."
        ],
        "source": "VSS",
        "reqAttune": true,
        "rarity": 4,
        "type": "AR"
    },
    {
        "name": "Smoking pipe of Dragon's Breath",
        "source": "VSS",
        "rarity": 3,
        "reqAttune": true,
        "entries": [
            "This pipe has 2 charges and regains 1 expended charge daily at dawn. If the pipe is full of one ounce of smoking herb, you can use an action and expend 1 charge to inhale deeply from it and exhale dragon's flame. Each creature in a 30-foot-radius cone must make a DC 15 Dexterity saving throw or take {@damage 8d6} fire damage, or half as much on a successful one."
        ],
        "type": "WI"
    },
    {
        "name": "Exploding Armor",
        "entries": [
            "(Variante di un armatura normale qualunque, oggetto è di un tipo specifico)",
            "While wearing this armor, you can use your action to cast {@spell fireball} (save DC 15), centered on yourself. You take no damage from this spell. The armor can't be used this way again until the next dawn."
        ],
        "source": "VSS",
        "rarity": 3,
        "type": "AR"
    },
    {
        "name": "Boots of the Trail",
        "source": "VSS",
        "rarity": 2,
        "entries": [
            "Until they are worn, the boots of the trail appear to be in grave disrepair. When you lace them up, the illusion fades: they are immaculate hiking boots with gold clasps and silk laces. While wearing these boots, you leave behind no tracks or other traces of your passage, and can't be tracked except by magical means. You can march for twice as long before suffering levels of {@condition exhaustion}.",
            "Additionally, you can remove the boots and speak a command word as an action to cause the boots to walk alone, leaving a false trail in any direction for up to one mile. The boots then teleport back to your feet."
        ],
        "type": "WI"
    },
    {
        "name": "Leaden Manacles",
        "source": "VSS",
        "rarity": 2,
        "entries": [
            "These manacles behave the same as normal manacles with the following addition: a creature that attempts to cast a spell while wearing the manacles must make a DC 12 ability check using its spellcasting ability. On a failure, the spell fails and has no effect; the spell slot is expended, the action is wasted, and the manacled creature takes {@damage 1d6} fire damage per level of the spell slot expended. On a success, the creature takes half as much damage and the spell is cast successfully."
        ],
        "type": "WI"
    },
    {
        "name": "Potion of Spell Recovery",
        "source": "tgs1",
        "type": "P",
        "rarity": 3,
        "entries": [
            "When you drink this potion, you recover expended spells slots with a combined level that is equal to or less than {@dice 1d3 + 3}, and none of the slots can be 6th level or higher."
        ],
        "image": "https://old.reddit.com/r/TheGriffonsSaddlebag/comments/d2pjcs/the_griffons_saddlebag_potion_of_spell_recovery/"
    },
    {
        "name": "Replica Clay",
        "source": "VSS",
        "rarity": 3,
        "type": "WI",
        "entries": [
            "When you touch this lump of clay to an object that can fit within a 5-foot cube, the clay shifts and molds into an exact replica with the same color and texture. The replica even mimics visual magical elements, such as glowing runes. Touching the replica reveals it to be made of clay, as it yields under any significant force, but it is impossible to distinguish with a visual inspection. Once the clay is shaped into a replica, it becomes nonmagical."
        ]
    },
    {
        "name": "Arrow of Explosions",
        "source": "VSS",
        "type": "A",
        "rarity": 4,
        "entries": [
            "When this arrow strikes a solid surface, be it a creature, object, wall, or floor, it explodes with a fiery blast. Each creature within 20 feet of the point of impact must make a DC 17 Dexterity saving throw. A creature takes {@damage 8d6} fire damage on a failed save, or half as much on a successful one. The arrow is destroyed in the blast."
        ]
    },
    {
        "name": "Ring of Icebergs",
        "source": "VSS",
        "type": "RG",
        "rarity": 4,
        "entries": [
            "As a bonus action, or a reaction to being hit by an attacker you can see, you can spin the ring's jewel, causing it to expand into a hollow block of clear ice that completely surrounds you. This iceberg occupies your space and pushes creatures within your space to the nearest unoccupied area, ending any grapple in which you are involved. There is enough room within the iceberg to move around, but you can't move more than 6 inches in any direction. Spells and other magical effects can't extend through the iceberg or be cast through it.",
            "The iceberg is an object with AC 10 and 100 HP. If it was activated as a reaction, it takes as much of the triggering damage as possible. The iceberg has immunity to cold, poison, and psychic damage, and vulnerability to fire damage. The icy tomb lasts for up to 1 minute, until it is destroyed, or until you use a bonus action to cease the jewel's spinning.",
            "Once you spin the ring to create an iceberg, you can't do so again until the following dawn."
        ]
    },
    {
        "name": "Apple of Arborea",
        "source": "KTKCG",
        "rarity": 5,
        "type": "Comp",
        "property": [
            "Exo"
        ],
        "diff": 6,
        "entries": [
            "Consuming this apple has the effect of {@spell greater restoration} cast upon the person that consumes it. If the creature that consumes it is Good aligned, they gain the benefit of {@spell death ward} until they finish a long rest.",
            "Adding it to a potion makes that potion confer the effects of eating it, but has no alignment restrictions."
        ]
    }
]